[Threat - WL002 - Mass Mailer Traffic Profile - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1567"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL002 - Mass Mailer Traffic Profile
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src","risk_object_type":"system","risk_score":45}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 2 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=true count AS num_mass_mailings dc(All_Traffic.dest) AS unique_destinations from datamodel=Network_Traffic where  All_Traffic.protocol=smtp by _time All_Traffic.src span=10min\
| rename All_Traffic.src AS src\
| eventstats median(num_mass_mailings) as median p25(num_mass_mailings) as p25 p75(num_mass_mailings) as p75 by src\
| eval IQR=(p75-p25)\
| eval sensitivity = 10\
| eval upperBound=(median+IQR*sensitivity)\
| eval isOutlier=if(num_mass_mailings > upperBound, 1, 0)\
| where (isOutlier=1)\
| eval event_time = strftime(_time,"%F %H:%M:%S")\
| eval severity=case(num_mass_mailings>100,"high",num_mass_mailings>10,"medium",1=1,"low")\
| eval urgency="high"\
| eval desc = "The host ".src." sent ".count." emails to ".unique_destinations." hosts."

[Threat - WL001 - DGA Domains - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1568"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL001 - DGA Domains
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 1 * * * *
description = This search looks for traffic from sources to DGA domains. The riskiness of the domain (1-100) is returned from Whiteleaf AI and then applied to the source in the risk index.
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats values(DNS.answer) as IPs min(_time) as firstTime  max(_time) as lastTime from datamodel=Network_Resolution by DNS.src, DNS.query \
| `drop_dm_object_name(DNS)` \
| rename query AS domain \
| fields IPs, src, domain, firstTime, lastTime\
| eval prompt = domain\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=src param.risk_object_type=system

[Threat - WL003 - DNS Tunneling - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1572"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL003 - DNS Tunneling
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src","risk_object_type":"system","risk_score":60}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 3 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Network_Resolution where NOT (DNS.message_type=Pointer OR DNS.message_type=PTR) by DNS.query DNS.src\
| rename DNS.* AS *\
| eval tlds=split(query,".")\
| eval tld=mvindex(tlds,-1)\
| eval tld_len=len(tld)\
| search tld_len<=24\
| eval query_length = len(query)\
| table query query_length record_type count src\
| eventstats median(query_length) as median p25(query_length) as p25 p75(query_length) as p75\
| eval IQR=(p75-p25)\
| eval sensitivity = 10\
| eval upperBound=(median+IQR*sensitivity)\
| eval isOutlier=if(query_length > upperBound, 1, 0)\
| where (isOutlier=1) AND query_length>100\
| eval event_time = strftime(_time,"%F %H:%M:%S")\
| eval severity="high"\
| eval urgency="high"\
| eval desc = "The asset ".src." produced an anomalously long ".query length." DNS request."

[Threat - WL004 - Anomalous ANY DNS Querying - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1498"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL004 - Anomalous ANY DNS Querying
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"dest","risk_object_type":"system","risk_score":60}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 4 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Network_Resolution where nodename=DNS DNS.message_type=QUERY DNS.record_type=ANY by DNS.dest _time span=1h\
| rename DNS.* AS *\
| eventstats median(count) as median p25(count) as p25 p75(count) as p75 by dest\
| eval IQR=(p75-p25)\
| eval sensitivity = 3\
| eval upperBound=(median+IQR*sensitivity)\
| eval isOutlier=if(count > upperBound, 1, 0)\
| where (isOutlier=1)\
| eval event_time = strftime(_time,"%F %H:%M:%S")\
| eval severity="high"\
| eval urgency="high"\
| eval desc = "The anomalously large number of ANY DNS requests associated with ".dest." indicate a potential mailicious DDoS attack."

[Threat - WL005 - Windows Exchange Autodiscover SSRF Abuse - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1190","T1133"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL005 - Windows Exchange Autodiscover SSRF Abuse
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"user","risk_object_type":"user","risk_score":80},{"risk_object_field":"dest","risk_object_type":"system","risk_score":80}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Web where (Web.status=200) AND Web.http_method=POST by Web.src Web.status Web.uri_path Web.dest Web.http_method Web.uri_query Web.http_user_agent \
| `drop_dm_object_name("Web")` \
| eval is_autodiscover=if(like(lower(uri_path),"%autodiscover/autodiscover.json%"),1,0) \
| eval has_rps_cat=if(like(lower(uri_query),"%x-rps-cat=%"),1,0) \
| eval exchange_backend=if(like(lower(uri_query),"%/powershell/?%"),1,0) \
| eval mapi=if(like(uri_query,"%/mapi/%"),1,0) \
| eval suspicious_agent=if(match(lower(http_user_agent), "python\
|urllib"),1,0) \
| addtotals fieldname=Score is_autodiscover, has_rps_cat, exchange_backend, mapi, suspicious_agent \
| where Score >= 3 \
| fields Score, src, dest, status, uri_query, uri_path, http_method, http_user_agent

[Threat - WL006 - SQL Injection - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1190"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL006 - SQL Injection
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 6 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Web where Web.dest_category=web_server AND (Web.url_length > 1024 OR Web.http_user_agent_length > 200) by Web.src Web.dest Web.url Web.url_length Web.http_user_agent \
| `drop_dm_object_name("Web")` \
| eval url=lower(url) \
| eval num_sql_cmds=mvcount(split(url, "alter%20table")) + mvcount(split(url, "between")) + mvcount(split(url, "create%20table")) + mvcount(split(url, "create%20database")) + mvcount(split(url, "create%20index")) + mvcount(split(url, "create%20view")) + mvcount(split(url, "delete")) + mvcount(split(url, "drop%20database")) + mvcount(split(url, "drop%20index")) + mvcount(split(url, "drop%20table")) + mvcount(split(url, "exists")) + mvcount(split(url, "exec")) + mvcount(split(url, "group%20by")) + mvcount(split(url, "having")) + mvcount(split(url, "insert%20into")) + mvcount(split(url, "inner%20join")) + mvcount(split(url, "left%20join")) + mvcount(split(url, "right%20join")) + mvcount(split(url, "full%20join")) + mvcount(split(url, "select")) + mvcount(split(url, "distinct")) + mvcount(split(url, "select%20top")) + mvcount(split(url, "union")) + mvcount(split(url, "xp_cmdshell")) - 24 \
| where num_sql_cmds > 1\
| eval prompt = url\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system

[Threat - WL008 - Lookalike Domains in Email - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1583"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL008 - Lookalike Domains in Email
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 8 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Email.All_Email where All_Email.src_user_domain=* All_Email.recipient_domain=* by All_Email.recipient All_Email.src_user All_Email.subject \
| `drop_dm_object_name(All_Email)` \
| lookup top_1000_domains domain AS src_user_domain OUTPUT is_known AS src_domain_known \
| lookup top_1000_domains domain AS recipient_domain OUTPUT is_known AS recipient_domain_known \
| where recipient_domain_known = 0 AND src_domain_known = 0 \
| eval prompt = src_user_domain.",".recipient_domain\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=recipient param.risk_object_type=user

[Threat - WL009 - Lookalike Domains in Web - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1583"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL009 - Lookalike Domains in Web
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 9 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Web where Web.url_domain=* by Web.user Web.dest Web.action \
| `drop_dm_object_name(Web)` \
| lookup top_1000_domains domain AS url_domain OUTPUT is_known AS url_domain_known \
| where url_domain_known = 0\
| eval prompt = url_domain\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL010 - Suspicious Powershell Commands - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1059"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL010 - Suspicious Powershell Commands
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 10 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count values(Processes.process) as process values(Processes.parent_process) as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=powershell.exe by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  \
| rename Processes.* AS *\
| search (process=*-EncodedCommand* OR process=*-enc*) process=*-Exec* \
| eval prompt=process\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL007 - Process Executed from Suspicious File Path - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1543"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL007 - Process Executed from Suspicious File Path
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 7 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count from datamodel=Endpoint.Processes where Processes.process_path=*  by Processes.process_path Processes.dest Processes.user \
| `drop_dm_object_name(Processes)`\
| lookup common_paths_for_processes process_path OUTPUT is_known\
| where NOT is_known = 1\
| eval prompt = process_path\
| whiteleafai \
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL011 - Suspicious Linux Commands - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1059"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL011 - Suspicious Linux Commands
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 11 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count values(Processes.process) values(Processes.process_name) values(Processes.parent_process_name) dc(Processes.process) as distinct_commands dc(Processes.process_name) as distinct_process_names min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where [\
|inputlookup linux_tool_discovery_process \
| rename process as Processes.process \
|table Processes.process] by _time span=5m Processes.user Processes.dest \
| rename Processes.* AS *\
| where distinct_commands > 20 AND distinct_process_names > 1\
| eval prompt=process\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL012 - Monti Chrome Ransomware Attack - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1072"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL012 - Monti Chrome Ransomware Attack
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 12 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats  values(Processes.process) AS processes values(Processes.action) AS action min(_time) AS attack_start_time values(Processes.os) AS os values(Processes.hash) AS hashes from datamodel=Endpoint.Processes by Processes.dest Processes.user \
| rename Processes.* AS * \
| search processes="*chrome*"\
| eval prompt="Processes". processes ." Hashes ". hashes\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL013 - LOLBAS Network Traffic - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1105","T1567","T1218"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL013 - LOLBAS Network Traffic
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 13 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Network_Traffic.All_Traffic where All_Traffic.app=* by All_Traffic.app,All_Traffic.src,All_Traffic.src_ip,All_Traffic.user,All_Traffic.dest,All_Traffic.dest_ip \
| rename All_Traffic.* AS *\
| lookup top_1000_network_traffic_apps app OUTPUT is_known\
| where NOT is_known=1\
| eval prompt=app\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user param.risk_object_type=user

[Threat - WL014 - Blocked AWS Sign In Attempt Followed by Success - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1110"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL014 - Blocked AWS Sign In Attempt Followed by Success
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"user","risk_object_type":"user","risk_score":50}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 1
alert.suppress.fields = user
alert.suppress.period = 3600s
alert.track = 1
counttype = number of events
cron_schedule = 14 * * * *
disabled = 1
dispatch.earliest_time = -130m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = index=aws \
``` replace with... `cloudtrail` eventType="AwsConsoleSignIn" ```\
| stats count max(_time) AS latest_time min(_time) AS earliest_time by user action\
| eval most_recent_failure = if(action="failure",latest_time,0)\
| eval latest_success = if(action="success",earliest_time,9999999999)\
| stats max(most_recent_failure) As most_recent_failure  min(latest_success) AS latest_success by user| where latest_success < most_recent_failure\
| table user latest_success most_recent_failure

[Threat - WL015 - Windows Credential Dumping - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1003"]}
action.correlationsearch.enabled = 1
action.correlationsearch.label = WL015 - Windows Credential Dumping
action.customsearchbuilder.enabled = false
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
disabled = 1
dispatch.earliest_time = -70m
dispatch.latest_time = -10m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = index=windows ```needs to look for sysmon data``` EventCode=10 TargetImage=*\\lsass.exe granted_access IN ("0x01000", "0x1010", "0x1038", "0x40", "0x1400", "0x1fffff", "0x1410", "0x143a", "0x1438", "0x1000") CallTrace IN ("*dbgcore.dll*", "*dbghelp.dll*", "*ntdll.dll*", "*kernelbase.dll*", "*kernel32.dll*") NOT SourceUser IN ("NT AUTHORITY\\SYSTEM", "NT AUTHORITY\\NETWORK SERVICE") \
| stats count min(_time) as firstTime max(_time) as lastTime by CallTrace SecurityID TargetImage dest granted_access parent_process_id parent_process_name parent_process_path process_id process_name process_path signature user_id  \
| eval prompt=CallTrace.",". granted_access.",". TargetImage\
| whiteleafai\
| sendalert risk param.risk_score=risk_score param.risk_object_field=dest param.risk_object_type=system\
| sendalert risk param.risk_score=risk_score param.risk_object_field=user_id param.risk_object_type=user\
